// pages/tabBar/about/index.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text: 'GIF字幕所有内容都由网友自行发布提供，GIF字幕仅为网友提供信息的交流平台。根据用户的信息发布指令，GIF字幕系统会以非人工方式自动生成GIF。GIF字幕自身不控制、编辑或修改任何网页的信息。GIF字幕重视知识产权保护，并制定了旨在保护权利人的合法权益的措施和步骤，当权利人发现在GIF字幕的内容侵犯其著作权时，请权利人向GIF字幕发出书面“权利通知”，GIF字幕将依法采取措施移除相关内容或断开相关链接。 GIF字幕高度重视知识产权保护并遵守各项知识产权法律、法规和具有约束力的规范性文件。 根据法律、法规和规范性文件要求，GIF字幕制定了旨在保护知识产权权利人合法权益的措施和步骤，当著作权人或依法可以行使著作权的权利人（以下简称“权利人”）发现在GIF字幕网页的内容侵犯其著作权时，权利人应事先向GIF字幕发出书面的“权利通知”， GIF字幕将根据法律法规和政府规范性文件采取措施移除相关内容或断开相关链接。 具体措施和步骤如下： 权利通知 任何个人或单位如果同时符合以下两个条件： 1、是某一作品的著作权人或依法可以行使著作权的权利人；\n 2、通过用户上传信息指令以非人工方式自动生成的GIF侵犯了上述作品的著作权。\n 请上述个人或单位务必以书面的通讯方式向GIF字幕提交权利通知。 为有效处理上述个人或单位的权利通知，通知书应当包含下列内容： \n1、权利人的姓名(名称) 、联系方式和地址；\n 2、要求删除或者断开链接的侵权作品、表演、录像制品的名称和网络地址； \n 3、构成侵权的初步证明材料（包括且不限于权利人对涉嫌侵权内容拥有著作权或依法可以行使著作权的权属证明）。\n 4、权利人对通知书的真实性声明。\n 5、请您签署该文件，如果您是依法成立的机构或组织，请您加盖公章。\n 请您把以上资料和联络方式书面发往以下地址： snaildev@outlook.com '
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
  
  },
})